Add Classes field to use cases in section 4.3
